■■■■■■■■■■■■■■■■■■■■■■■■■■ EC2
・デフォルトだとAmazon ECS-Optimized Amazon Linux AMIで起動
・key pair、ロールなどを指定
・インスタンスタイプを指定またはおまかせ可能
※ C、M、R ファミリーから、最適なものが選択される
※立ち上がったインスタンスは、EC2、ECS の画面で確認可能

▼ クラスタ数指定
・クラスタ数上限を指定可能
※ vCPU 数で指定
※ EC2：コンテナを1:1で起動させたい場合は、コンテナで指定するvCPUs・メモリサイズを、利用するインスタンスサイズとイコールにします。
※ r3.xlarge(vCPUs4、メモリ30.5GB)、コンテナのリソースもvCPUs4、メモリ29GB等に設定
※ 利用できるメモリサイズは、インスタンスタイプのそれよりも小さくなる場合があり、
その場合 EC2 が自動で起動しないなどの不具合あり

・Max：4 ※r3.xlargeの場合は4に指定すると1インスタンスが起動する、8にすると2インスタンスが起動
・Min：0　※0にするとジョブキューがない場合はEC2は0
※ ジョブ実行時にEC2インスタンスの起動が必要になるためラグが発生
